In [1]:
print("my string value")

my string value

In [4]:
my_str_var = "this string"

In [5]:
len(my_str_var)

11

In [16]:
my_tuple = ("A", "B", "C")

In [6]:
my_list = ["A", "B", "C"]

In [7]:
print(my_list[0])

A

In [8]:
print(my_str_var[0])

t

In [9]:
import pandas as pd

In [11]:
df_data = {
    "col1": ["A", "B", "C"],
    "col2": [101, 102, 103]
}
df = pd.DataFrame(df_data)
df

  col1  col2
0    A   101
1    B   102
2    C   103

df["col1"]

In [12]:
df["col1"]

0    A
1    B
2    C
Name: col1, dtype: object

In [14]:
df[["col1", "col2"]]

  col1  col2
0    A   101
1    B   102
2    C   103

In [17]:
my_tuple[0]

'A'

In [19]:
## Properties and methods
df. shape

(3, 2)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      object
 1   col2    3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [21]:
df. info

<bound method DataFrame.info of   col1  col2
0    A   101
1    B   102
2    C   103>

In [23]:
df.describe()

        col2
count    3.0
mean   102.0
std      1.0
min    101.0
25%    101.5
50%    102.0
75%    102.5
max    103.0

In [24]:
##Stringing functions together
df_data2 = {
    "col1": ["A", "B", "C", "A", "B", "C", "A", "B", "C", "A", "B", "C", "A", "B", "C",],
    "col2": [101, 102, 103, 101, 102, 103, 101, 102, 103, 101, 102, 103, 101, 102, 103,]
}
df = pd.DataFrame(df_data2)
df

   col1  col2
0     A   101
1     B   102
2     C   103
3     A   101
4     B   102
5     C   103
6     A   101
7     B   102
8     C   103
9     A   101
10    B   102
11    C   103
12    A   101
13    B   102
14    C   103

In [25]:
df.describe()

             col2
count   15.000000
mean   102.000000
std      0.845154
min    101.000000
25%    101.000000
50%    102.000000
75%    103.000000
max    103.000000

In [28]:
grouped_df = df.groupby("col1")
print(grouped_df)
type(grouped_df)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F6C8377C70>

pandas.core.groupby.generic.DataFrameGroupBy

In [30]:
grouped_df.sum()

      col2
col1
A      505
B      510
C      515

In [31]:
grouped_df.mean()

       col2
col1
A     101.0
B     102.0
C     103.0

In [35]:
df3 = grouped_df.sum()
df3 = df3.reset_index()
df3

  col1  col2
0    A   505
1    B   510
2    C   515

In [ ]:
df4 = grouped_df.sum()
df4 = df4.reset_index()
df4

In [44]:
df5 = grouped_df.sum()
df5 = df5.reset_index()
df5

  col1  col2
0    A   505
1    B   510
2    C   515

In [45]:
df5 = df5.rename(columns={"col2_x": "sum", "col2_y": "mean"})
df5

  col1  col2
0    A   505
1    B   510
2    C   515

In [48]:
sum_df = df3.groupby("col1").sum()
sum_df

      col2
col1
A      505
B      510
C      515

In [42]:
##Curly Brackets
my_dictionary = {
    "key1": "value1",
    "key2": "value2"
}